wright0418/Richlink_Smart_Box-M482S-/SampleCode/RL_SPORT/test_mode.c
/**
 * @file test_mode.c
 * @brief UART0-driven hardware test mode implementation.
 *
 * Supports both an interactive UART menu entered by typing "test" and
 * the structured AT+TEST=<CMD> auto-test command interface.
 */
#include "test_mode.h"
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <math.h>
#include "NuMicro.h"
#include "project_config.h"
#include "drivers/timer.h"
#include "drivers/led.h"
#include "drivers/buzzer.h"
#include "drivers/gsensor.h"
#include "drivers/adc.h"
#include "drivers/ws2812b.h"
#include "board/gpio.h"
#include "board/board_test_gpio.h"
#include "board/usb_hid/usb_hid_mouse.h"
#include "ble.h"
#include "system_status.h"

static volatile uint8_t g_uart_test_mode = 0u;

/* ------------------------------------------------------------------ */
/* UART0 helpers                                                       */
/* ------------------------------------------------------------------ */

/**
 * @brief Read one character from UART0 without blocking.
 * @param out Pointer to receive the character.
 * @return 1 if a character was read, 0 if no data is available.
 */
static int UART0_ReadCharNonBlocking(char *out)
{
    if (UART_IS_RX_READY(UART0))
    {
        *out = (char)UART_READ(UART0);
        return 1;
    }
    return 0;
}

/**
 * @brief Read a line from UART0, blocking until CR/LF.
 * @param buf Destination buffer to store the line.
 * @param buf_len Size of the destination buffer.
 */
static void UART0_ReadLineBlocking(char *buf, uint32_t buf_len)
{
    uint32_t idx = 0;
    while (1)
    {
        char c = 0;
        if (UART0_ReadCharNonBlocking(&c))
        {
            if (c == '\r' || c == '\n')
            {
                if (idx < buf_len)
                {
                    buf[idx] = '\0';
                }
                return;
            }
            if (idx + 1 < buf_len)
            {
                buf[idx++] = c;
            }
        }
    }
}

/* ------------------------------------------------------------------ */
/* AT+TEST= command dispatcher (forward declaration)                   */
/* ------------------------------------------------------------------ */
static void AT_DispatchCommand(const char *line);

/* ------------------------------------------------------------------ */
/* Poll entry: detect "test" OR "AT+TEST=" prefix                      */
/* ------------------------------------------------------------------ */

#define AT_PREFIX "AT+TEST="
#define AT_PREFIX_LEN 8
#define CMD_BUF_SIZE 64

/* Shared AT test thresholds/timeouts (single item + ALL must stay aligned) */
#define TEST_I2C_MAG_MIN_G 0.2f /* low floor: tilted board at cpg=2048 may read ~0.3g and still be alive */
#define TEST_I2C_MAG_MAX_G 2.0f
#define TEST_BLE_SETTLE_MS 200u
#define TEST_BLE_NAME_TIMEOUT_MS 2500u
#define TEST_BLE_MAC_TIMEOUT_MS 3000u
#define TEST_GSENSOR_CAL_SAMPLES 64u
#define TEST_GSENSOR_CAL_SAMPLE_INTERVAL_MS 20u
#define TEST_IMU_STATIC_DEFAULT_SAMPLES 20u
#define TEST_IMU_STATIC_MIN_SAMPLES 10u
#define TEST_IMU_STATIC_MAX_SAMPLES 100u
#define TEST_IMU_STATIC_ACC_MEAN_MIN_G 0.50f
#define TEST_IMU_STATIC_ACC_MEAN_MAX_G 1.60f
#define TEST_IMU_STATIC_ACC_STD_MAX_G 0.08f
#define TEST_IMU_STATIC_GYRO_ABS_MEAN_MAX 2500u

static float s_gsensor_cal_scale = 1.0f;
static uint8_t s_gsensor_cal_valid = 0u;

static uint8_t is_decimal_token(const char *s)
{
    if (!s || !*s)
    {
        return 0u;
    }

    while (*s)
    {
        if (*s < '0' || *s > '9')
        {
            return 0u;
        }
        s++;
    }
    return 1u;
}

/**
 * @brief Poll UART0 for the test menu entry command or AT+TEST prefix.
 *
 * If the user types "test" on UART0, interactive test mode is entered.
 * If an AT+TEST= command is received, it is dispatched immediately.
 */
void TestMode_PollEnter(void)
{
    static char cmd_buf[CMD_BUF_SIZE];
    static uint8_t cmd_idx = 0;
    char c = 0;

    while (UART0_ReadCharNonBlocking(&c))
    {
        if (c == '\r' || c == '\n')
        {
            if (cmd_idx == 0)
                continue; /* ignore empty lines */

            cmd_buf[cmd_idx] = '\0';

            /* Check for AT+TEST= prefix first */
            if (cmd_idx >= AT_PREFIX_LEN &&
                strncmp(cmd_buf, AT_PREFIX, AT_PREFIX_LEN) == 0)
            {
                AT_DispatchCommand(cmd_buf + AT_PREFIX_LEN);
            }
            else if (strcmp(cmd_buf, "test") == 0)
            {
                g_uart_test_mode = 1u;
            }

            cmd_idx = 0;
            cmd_buf[0] = '\0';
            return;
        }

        if (cmd_idx + 1 < sizeof(cmd_buf))
        {
            cmd_buf[cmd_idx++] = c;
        }
    }
}

void TestMode_ForceEnter(void)
{
    g_uart_test_mode = 1u;
}

static void Test_LED(void)
{
    printf("[Test] LED Green(PB3)+Yellow(PB2) blink x3\n");
    for (int i = 0; i < 3; ++i)
    {
        PB->DOUT |= (BIT2 | BIT3);
        delay_ms(100);
        PB->DOUT &= ~(BIT2 | BIT3);
        delay_ms(100);
    }
}

static void Test_WS2812Rainbow(void)
{
    static const WS2812B_Color k_rainbow[] = {
        {255u, 0u, 0u},
        {255u, 64u, 0u},
        {255u, 128u, 0u},
        {255u, 255u, 0u},
        {0u, 255u, 0u},
        {0u, 255u, 128u},
        {0u, 255u, 255u},
        {0u, 128u, 255u},
        {0u, 0u, 255u},
        {64u, 0u, 255u},
        {128u, 0u, 255u},
        {255u, 0u, 255u},
        {255u, 0u, 128u},
        {255u, 0u, 64u},
        {255u, 32u, 32u},
        {255u, 255u, 255u}};
    const uint8_t color_count = (uint8_t)(sizeof(k_rainbow) / sizeof(k_rainbow[0]));

    printf("[Test] WS2812 rainbow every 16 LEDs\n");
    for (uint16_t i = 0u; i < (uint16_t)MOLE_WS2812_LED_COUNT; i++)
    {
        uint8_t color_idx = (uint8_t)((i / 16u) % color_count);
        WS2812B_Color color = k_rainbow[color_idx];
        WS2812B_SetPixel(i, color.r, color.g, color.b);
    }
    (void)WS2812B_Refresh();
}

static uint8_t Test_IMUStatic(uint32_t samples)
{
    uint32_t comm_fail = 0u;
    float mean = 0.0f;
    float m2 = 0.0f;
    uint32_t count = 0u;
    uint64_t gyro_abs_sum = 0u;
    const uint8_t is_sc7 = (GsensorGetDeviceType() == GSENSOR_DEVICE_SC7U22) ? 1u : 0u;

    if (samples < TEST_IMU_STATIC_MIN_SAMPLES)
        samples = TEST_IMU_STATIC_MIN_SAMPLES;
    if (samples > TEST_IMU_STATIC_MAX_SAMPLES)
        samples = TEST_IMU_STATIC_MAX_SAMPLES;

    printf("[Test] IMU static test samples=%lu sensor=%s\n",
           (unsigned long)samples,
           GsensorGetDeviceName());

    for (uint32_t i = 0u; i < samples; i++)
    {
        int16_t acc[3] = {0};
        int16_t gyro[3] = {0};
        uint8_t ok = GsensorReadSixAxis(acc, gyro);
        if (!ok)
        {
            comm_fail++;
            continue;
        }

        float mag_g = Gsensor_CalcMagnitude_g_from_raw(acc);
        count++;
        float delta = mag_g - mean;
        mean += delta / (float)count;
        m2 += delta * (mag_g - mean);

        gyro_abs_sum += (uint64_t)abs((int)gyro[0]);
        gyro_abs_sum += (uint64_t)abs((int)gyro[1]);
        gyro_abs_sum += (uint64_t)abs((int)gyro[2]);

