wright0418/Richlink_Smart_Box-M482S-/SampleCode/RL_SPORT/test_mode.c
        delay_ms(20u);
    }

    if (count == 0u)
    {
        printf("[Test] IMU static FAIL: no valid sample\n");
        return 0u;
    }

    float stddev = (count > 1u) ? sqrtf(m2 / (float)(count - 1u)) : 0.0f;
    uint32_t gyro_abs_mean = (uint32_t)(gyro_abs_sum / ((uint64_t)count * 3ull));

    printf("[Test] IMU static result mean=%.3f std=%.3f gyro_abs_mean=%lu comm_fail=%lu\n",
           (double)mean,
           (double)stddev,
           (unsigned long)gyro_abs_mean,
           (unsigned long)comm_fail);

    if (comm_fail > 0u)
    {
        return 0u;
    }
    if (mean < TEST_IMU_STATIC_ACC_MEAN_MIN_G || mean > TEST_IMU_STATIC_ACC_MEAN_MAX_G)
    {
        return 0u;
    }
    if (stddev > TEST_IMU_STATIC_ACC_STD_MAX_G)
    {
        return 0u;
    }
    if (is_sc7 && (gyro_abs_mean > TEST_IMU_STATIC_GYRO_ABS_MEAN_MAX))
    {
        return 0u;
    }

    return 1u;
}

static void Test_Buzzer(void)
{
    printf("[Test] Buzzer PC7 beep\n");
    BuzzerPlay(1000, 200);
    delay_ms(250);
}

static void Test_Key(void)
{
    printf("[Test] Key KEYA(PB15) / KEYB(PC0): press within 5s\n");
    uint32_t start = get_ticks_ms();
    while (!is_timeout(start, 5000))
    {
        if ((GPIO_GET_IN_DATA(PB) & BIT15) == 0)
        {
            printf("[Test] KEYA(PB15) pressed\n");
            return;
        }
        if ((GPIO_GET_IN_DATA(PC) & BIT0) == 0)
        {
            printf("[Test] KEYB(PC0) pressed\n");
            return;
        }
    }
    printf("[Test] Key TIMEOUT\n");
}

static void Test_Hall(void)
{
    printf("[Test] HALL PB7/PB8: read for 3s\n");
    uint32_t start = get_ticks_ms();
    uint32_t last_pb7 = (PB->PIN & BIT7) ? 1u : 0u;
    uint32_t last_pb8 = (PB->PIN & BIT8) ? 1u : 0u;
    while (!is_timeout(start, 3000))
    {
        uint32_t pb7 = (PB->PIN & BIT7) ? 1u : 0u;
        uint32_t pb8 = (PB->PIN & BIT8) ? 1u : 0u;
        if (pb7 != last_pb7 || pb8 != last_pb8)
        {
            printf("[Test] PB7=%lu PB8=%lu\n", (unsigned long)pb7, (unsigned long)pb8);
            last_pb7 = pb7;
            last_pb8 = pb8;
        }
        delay_ms(50);
    }
}

static void Test_Gsensor(void)
{
    printf("[Test] G-sensor I2C read (3 samples)\n");
    for (int i = 0; i < 3; ++i)
    {
        int16_t axis[3] = {0};
        GsensorReadAxis(axis);
        printf("[Test] XYZ = %d, %d, %d\n", axis[0], axis[1], axis[2]);
        delay_ms(50);
    }
}

static void Test_ADC(void)
{
    printf("[Test] VDDA (band-gap)\n");
    Adc_UpdateVdda();
    float vdda = Adc_GetVdda();
    uint32_t vdda_mv = (uint32_t)(vdda * 1000.0f);
    uint32_t low_mv = (uint32_t)(ADC_VDDA_LOW_V * 100.0f);
    printf("[Test] vdda=%lu.%03luV (low<%lu.%02luV) %s\n",
           (unsigned long)(vdda_mv / 1000u), (unsigned long)(vdda_mv % 1000u),
           (unsigned long)(low_mv / 100u), (unsigned long)(low_mv % 100u),
           Adc_IsVddaLow() ? "LOW" : "OK");
}

static void Test_USB(void)
{
    printf("[Test] USB FS HID Mouse auto test: 5s\n");
    UsbHidMouse_TestStart();

    uint32_t start = get_ticks_ms();
    uint32_t last_update = get_ticks_ms();
    while (!is_timeout(start, 5000))
    {
        if (get_elapsed_ms(last_update) >= 1u)
        {
            last_update = get_ticks_ms();
            UsbHidMouse_TestUpdate();
        }
    }

    UsbHidMouse_TestStop();
    printf("[Test] USB auto test done\n");
}

static uint8_t Test_BLE_WaitMode(uint8_t target_mode, uint32_t timeout_ms)
{
    uint32_t start = get_ticks_ms();
    while (!is_timeout(start, timeout_ms))
    {
        CheckBleRecvMsg();
        if (Sys_GetBleMode() == target_mode)
        {
            return 1u;
        }
        delay_ms(5u);
    }
    return 0u;
}

static uint8_t Test_BLE_SwitchToCmdMode(void)
{
    Sys_SetBleMode(0u);
    BLE_UART_SEND((void *)UART1, "%s", BLE_CMD_DLPS_OFF);
    delay_ms(60u);
    BLE_UART_SEND((void *)UART1, "%s", BLE_CMD_ADVERT_ON);
    delay_ms(30u);
    BLE_UART_SEND((void *)UART1, "%s", BLE_CMD_MODE_DATA);
    (void)Test_BLE_WaitMode(1u, 800u);

    /* Single attempt only: if CMD mode cannot be entered once, fail. */
    BLE_UART_SEND((void *)UART1, "%s", BLE_CMD_CCMD);
    uint8_t ok = Test_BLE_WaitMode(0u, 1200u);
    return ok;
}

static uint8_t Test_BLE_SwitchToDataMode(void)
{
    Sys_SetBleMode(0u);
    BLE_UART_SEND((void *)UART1, "%s", BLE_CMD_MODE_DATA);
    return Test_BLE_WaitMode(1u, 400u);
}

static uint8_t Test_BLE_CopyDeviceNameSnapshot(char *dst, uint32_t dst_size)
{
    return (uint8_t)(Sys_CopyDeviceName(dst, dst_size) > 0u);
}

static uint8_t Test_BLE_CopyMacAddrSnapshot(char *dst, uint32_t dst_size)
{
    return (uint8_t)(Sys_CopyMacAddr(dst, dst_size) > 0u);
}

static void Test_BLE_AT_CMD(void)
{
    const uint32_t timeout_ms = 2000u;
    uint32_t start = get_ticks_ms();
    uint8_t got_name_resp = 0u;
    uint8_t pass = 0u;
    char device_name[SYS_DEVICE_NAME_BUF_SIZE];

    printf("[Test] BLE AT CMD: query name, expect ROPR_\n");

    if (!Test_BLE_SwitchToCmdMode())
    {
        printf("[Test] BLE_AT_CMD FAIL: cannot enter CMD mode after retries\n");
        return;
    }

    Sys_ClearDeviceName();
    BLE_UART_SEND((void *)UART1, "%s", BLE_CMD_NAME_QUERY);

    while (!is_timeout(start, timeout_ms))
    {
        CheckBleRecvMsg();

        if (Test_BLE_CopyDeviceNameSnapshot(device_name, (uint32_t)sizeof(device_name)))
        {
            got_name_resp = 1u;
            printf("[Test] BLE NAME = %s\n", device_name);

            /* Single read result: one response is enough to decide pass/fail. */
            if ((strstr(device_name, "ROPR_") != NULL) || (strstr(device_name, "ROPE_") != NULL))
            {
                pass = 1u;
            }
            break;
        }

        delay_ms(5u);
    }

    if (pass)
    {
        printf("[Test] BLE_AT_CMD PASS\n");
    }
    else if (!got_name_resp)
    {
        printf("[Test] BLE_AT_CMD FAIL: no name response\n");
    }
    else
    {
        printf("[Test] BLE_AT_CMD FAIL: name format invalid\n");
    }

    if (!Test_BLE_SwitchToDataMode())
    {
        printf("[Test] WARN: failed to return DATA mode\n");
    }
}

