wright0418/Richlink_Smart_Box-M482S-/SampleCode/RL_SPORT/test_mode.c
static void RunAllTests(void)
{
    BoardTest_RunAll();
}

static void UART0_TestMenuLoop(void)
{
    char line[8];
    printf("\n=== UART0 Test Mode ===\n");
    printf("1) LED PB2/PB3\n");
    printf("2) Buzzer PC7\n");
    printf("3) Key KEYA(PB15) / KEYB(PC0)\n");
    printf("4) HALL PB7/PB8\n");
    printf("5) G-sensor I2C\n");
    printf("6) VDDA (band-gap)\n");
    printf("7) Run full board test\n");
    printf("8) USB FS HID Mouse (auto 5s)\n");
    printf("9) BLE AT CMD name check\n");
    printf("a) WS2812 16x16 rainbow test\n");
    printf("b) IMU 6-axis static test\n");
    printf("0) Exit\n");

    while (g_uart_test_mode)
    {
        printf("Select> ");
        UART0_ReadLineBlocking(line, sizeof(line));

        switch (line[0])
        {
        case '1':
            Test_LED();
            break;
        case '2':
            Test_Buzzer();
            break;
        case '3':
            Test_Key();
            break;
        case '4':
            Test_Hall();
            break;
        case '5':
            Test_Gsensor();
            break;
        case '6':
            Test_ADC();
            break;
        case '7':
            RunAllTests();
            break;
        case '8':
            Test_USB();
            break;
        case '9':
            Test_BLE_AT_CMD();
            break;
        case 'a':
        case 'A':
            Test_WS2812Rainbow();
            break;
        case 'b':
        case 'B':
            (void)Test_IMUStatic(TEST_IMU_STATIC_DEFAULT_SAMPLES);
            break;
        case '0':
            g_uart_test_mode = 0u;
            printf("Exit test mode\n");
            break;
        default:
            printf("Unknown option\n");
            break;
        }
    }
}

void TestMode_RunMenuIfActive(void)
{
    if (g_uart_test_mode)
    {
        UART0_TestMenuLoop();
    }
}

/* ================================================================== */
/*  AT+TEST= Auto-Test Command Implementations                        */
/* ================================================================== */

/* Helper: parse a uint32 from string, returns 0 on empty/null */
static uint32_t parse_u32(const char *s)
{
    if (!s || !*s)
        return 0u;
    return (uint32_t)strtoul(s, NULL, 10);
}

/* Helper: find next comma-delimited token; returns pointer after comma or NULL */
static const char *next_param(const char *s)
{
    if (!s)
        return NULL;
    const char *p = strchr(s, ',');
    if (p)
        return p + 1;
    return NULL;
}

/* Helper: copy first comma-delimited token into buf (upper-bound len) */
static void copy_token(const char *s, char *buf, uint32_t buf_len)
{
    uint32_t i = 0;
    if (!s)
    {
        buf[0] = '\0';
        return;
    }
    while (*s && *s != ',' && i + 1 < buf_len)
    {
        buf[i++] = *s++;
    }
    buf[i] = '\0';
}

/* ------------------------------------------------------------------ */
/* AT+TEST=INFO                                                        */
/* ------------------------------------------------------------------ */
static uint8_t AT_Info(const char *param)
{
    (void)param;
    printf("+TEST:INFO,PASS,FW=%s,BRD=%s,BUILD=%s_%s\r\n",
           TEST_FW_VERSION, TEST_BOARD_NAME, FW_BUILD_DATE, FW_BUILD_TIME);
    return 1u;
}

/* ------------------------------------------------------------------ */
/* AT+TEST=LED,<ON|OFF|BLINK>                                          */
/* ------------------------------------------------------------------ */
static uint8_t AT_Led(const char *param)
{
    char tok[12];
    copy_token(param, tok, sizeof(tok));

    if (strcmp(tok, "ON") == 0)
    {
        PB->DOUT |= BIT3;
        printf("+TEST:LED,PASS,STATE=ON\r\n");
        return 1u;
    }
    if (strcmp(tok, "OFF") == 0)
    {
        PB->DOUT &= ~BIT3;
        printf("+TEST:LED,PASS,STATE=OFF\r\n");
        return 1u;
    }
    if (strcmp(tok, "BLINK") == 0)
    {
        for (int i = 0; i < 3; ++i)
        {
            PB->DOUT |= BIT3;
            delay_ms(100);
            PB->DOUT &= ~BIT3;
            delay_ms(100);
        }
        printf("+TEST:LED,PASS,BLINK=3\r\n");
        return 1u;
    }

    if (strcmp(tok, "YON") == 0)
    {
        PB->DOUT |= BIT2;
        printf("+TEST:LED,PASS,YELLOW=ON\r\n");
        return 1u;
    }
    if (strcmp(tok, "YOFF") == 0)
    {
        PB->DOUT &= ~BIT2;
        printf("+TEST:LED,PASS,YELLOW=OFF\r\n");
        return 1u;
    }
    if (strcmp(tok, "BOTH_ON") == 0)
    {
        PB->DOUT |= (BIT2 | BIT3);
        printf("+TEST:LED,PASS,BOTH=ON\r\n");
        return 1u;
    }
    if (strcmp(tok, "BOTH_OFF") == 0)
    {
        PB->DOUT &= ~(BIT2 | BIT3);
        printf("+TEST:LED,PASS,BOTH=OFF\r\n");
        return 1u;
    }

    printf("+TEST:LED,FAIL,BAD_PARAM\r\n");
    return 0u;
}

static uint8_t AT_Ws2812(const char *param)
{
    char tok[12];
    copy_token(param, tok, sizeof(tok));

    if (strcmp(tok, "RAINBOW") != 0)
    {
        printf("+TEST:WS2812,FAIL,BAD_PARAM\r\n");
        return 0u;
    }

    Test_WS2812Rainbow();
    printf("+TEST:WS2812,PASS,MODE=RAINBOW,SEG=16\r\n");
    return 1u;
}

static uint8_t AT_Imu(const char *param)
{
    char tok[12];
    uint32_t samples = TEST_IMU_STATIC_DEFAULT_SAMPLES;
    copy_token(param, tok, sizeof(tok));

    if (strcmp(tok, "STATIC") != 0)
    {
        printf("+TEST:IMU,FAIL,BAD_PARAM\r\n");
        return 0u;
    }

    const char *p2 = next_param(param);
    if (p2 && *p2)
    {
        samples = parse_u32(p2);
    }

    if (samples < TEST_IMU_STATIC_MIN_SAMPLES)
        samples = TEST_IMU_STATIC_MIN_SAMPLES;
    if (samples > TEST_IMU_STATIC_MAX_SAMPLES)
        samples = TEST_IMU_STATIC_MAX_SAMPLES;

    /* Re-init wake path to keep test deterministic after long idle. */
    GsensorWakeup();
    delay_ms(50u);

    int16_t acc[3] = {0};
    int16_t gyro[3] = {0};
    float mean = 0.0f;
    float m2 = 0.0f;
    uint32_t valid = 0u;
    uint32_t comm_fail = 0u;
    uint64_t gyro_abs_sum = 0u;
    const uint8_t is_sc7 = (GsensorGetDeviceType() == GSENSOR_DEVICE_SC7U22) ? 1u : 0u;

    for (uint32_t i = 0u; i < samples; i++)
    {
        if (!GsensorReadSixAxis(acc, gyro))
        {
            comm_fail++;
            delay_ms(20u);
            continue;
        }

        float mag_g = Gsensor_CalcMagnitude_g_from_raw(acc);
        valid++;
        float delta = mag_g - mean;
        mean += delta / (float)valid;
        m2 += delta * (mag_g - mean);

        gyro_abs_sum += (uint64_t)abs((int)gyro[0]);
        gyro_abs_sum += (uint64_t)abs((int)gyro[1]);
        gyro_abs_sum += (uint64_t)abs((int)gyro[2]);

