wright0418/Richlink_Smart_Box-M482S-/SampleCode/RL_SPORT/test_mode.c
        delay_ms(20u);
    }

    if (valid == 0u)
    {
        printf("+TEST:IMU,FAIL,NO_SAMPLE\r\n");
        return 0u;
    }

    float stddev = (valid > 1u) ? sqrtf(m2 / (float)(valid - 1u)) : 0.0f;
    uint32_t gyro_abs_mean = (uint32_t)(gyro_abs_sum / ((uint64_t)valid * 3ull));

    uint8_t pass = 1u;
    if (comm_fail > 0u)
        pass = 0u;
    if (mean < TEST_IMU_STATIC_ACC_MEAN_MIN_G || mean > TEST_IMU_STATIC_ACC_MEAN_MAX_G)
        pass = 0u;
    if (stddev > TEST_IMU_STATIC_ACC_STD_MAX_G)
        pass = 0u;
    if (is_sc7 && (gyro_abs_mean > TEST_IMU_STATIC_GYRO_ABS_MEAN_MAX))
        pass = 0u;

    uint32_t mean_i = (uint32_t)(mean * 1000.0f);
    uint32_t std_i = (uint32_t)(stddev * 1000.0f);

    printf("+TEST:IMU,%s,MODE=STATIC,SENSOR=%s,SAMPLES=%lu,VALID=%lu,COMM_FAIL=%lu,ACC_MEAN=%lu.%03lu,ACC_STD=%lu.%03lu,GYRO_ABS_MEAN=%lu\r\n",
           pass ? "PASS" : "FAIL",
           GsensorGetDeviceName(),
           (unsigned long)samples,
           (unsigned long)valid,
           (unsigned long)comm_fail,
           (unsigned long)(mean_i / 1000u), (unsigned long)(mean_i % 1000u),
           (unsigned long)(std_i / 1000u), (unsigned long)(std_i % 1000u),
           (unsigned long)gyro_abs_mean);

    return pass;
}

/* ------------------------------------------------------------------ */
/* AT+TEST=BUZZER[,freq,dur]                                           */
/* ------------------------------------------------------------------ */
static uint8_t AT_Buzzer(const char *param)
{
    uint32_t freq = 1000u;
    uint32_t dur = 200u;

    if (param && *param)
    {
        freq = parse_u32(param);
        const char *p2 = next_param(param);
        if (p2)
            dur = parse_u32(p2);
    }

    if (freq == 0)
        freq = 1000u;
    if (dur == 0)
        dur = 200u;

    BuzzerPlay(freq, dur);
    delay_ms(dur + 50u);

    printf("+TEST:BUZZER,PASS,FREQ=%lu,DUR=%lu\r\n",
           (unsigned long)freq, (unsigned long)dur);
    return 1u;
}

/* ------------------------------------------------------------------ */
/* AT+TEST=KEY[,timeout_ms]                                            */
/* ------------------------------------------------------------------ */
static uint8_t AT_Key(const char *param)
{
    uint32_t timeout = 5000u;
    uint8_t watch_keya = 1u;
    uint8_t watch_keyb = 1u;

    if (param && *param)
    {
        char tok1[12];
        copy_token(param, tok1, sizeof(tok1));

        if (is_decimal_token(tok1))
        {
            timeout = parse_u32(tok1);
        }
        else if ((strcmp(tok1, "A") == 0) || (strcmp(tok1, "KEYA") == 0))
        {
            watch_keya = 1u;
            watch_keyb = 0u;
            const char *p2 = next_param(param);
            if (p2 && *p2)
            {
                timeout = parse_u32(p2);
            }
        }
        else if ((strcmp(tok1, "B") == 0) || (strcmp(tok1, "KEYB") == 0))
        {
            watch_keya = 0u;
            watch_keyb = 1u;
            const char *p2 = next_param(param);
            if (p2 && *p2)
            {
                timeout = parse_u32(p2);
            }
        }
        else if (strcmp(tok1, "AB") == 0)
        {
            watch_keya = 1u;
            watch_keyb = 1u;
            const char *p2 = next_param(param);
            if (p2 && *p2)
            {
                timeout = parse_u32(p2);
            }
        }
        else
        {
            printf("+TEST:KEY,FAIL,BAD_PARAM\r\n");
            return 0u;
        }
    }

    if (timeout == 0)
        timeout = 5000u;

    uint32_t start = get_ticks_ms();
    while (!is_timeout(start, timeout))
    {
        if (watch_keya && ((GPIO_GET_IN_DATA(PB) & BIT15) == 0))
        {
            uint32_t elapsed = get_elapsed_ms(start);
            printf("+TEST:KEY,PASS,KEY=KEYA,T=%lu\r\n", (unsigned long)elapsed);
            return 1u;
        }
        if (watch_keyb && ((GPIO_GET_IN_DATA(PC) & BIT0) == 0))
        {
            uint32_t elapsed = get_elapsed_ms(start);
            printf("+TEST:KEY,PASS,KEY=KEYB,T=%lu\r\n", (unsigned long)elapsed);
            return 1u;
        }
    }
    if (watch_keya && watch_keyb)
    {
        printf("+TEST:KEY,FAIL,TIMEOUT,KEY=AB\r\n");
    }
    else if (watch_keya)
    {
        printf("+TEST:KEY,FAIL,TIMEOUT,KEY=KEYA\r\n");
    }
    else
    {
        printf("+TEST:KEY,FAIL,TIMEOUT,KEY=KEYB\r\n");
    }
    return 0u;
}

/* ------------------------------------------------------------------ */
/* AT+TEST=HALL  or  AT+TEST=HALL,WAIT,timeout_ms                      */
/* ------------------------------------------------------------------ */
static uint8_t AT_Hall(const char *param)
{
    char tok[8];
    copy_token(param, tok, sizeof(tok));

    if (strcmp(tok, "WAIT") == 0)
    {
        /* Wait for PB7 to produce >= 2 edge transitions (interrupts).
           Only PB7 is evaluated; PB8 is ignored in WAIT mode. */
        const char *p2 = next_param(param);
        uint32_t timeout = 3000u;
        if (p2 && *p2)
            timeout = parse_u32(p2);
        if (timeout == 0)
            timeout = 3000u;

        uint32_t last_pb7 = (PB->PIN & BIT7) ? 1u : 0u;
        uint32_t pb7_edges = 0u;
        uint32_t start = get_ticks_ms();

        while (!is_timeout(start, timeout))
        {
            uint32_t pb7_now = (PB->PIN & BIT7) ? 1u : 0u;
            if (pb7_now != last_pb7)
            {
                pb7_edges++;
                last_pb7 = pb7_now;
                if (pb7_edges >= 2u)
                {
                    printf("+TEST:HALL,PASS,EDGE=PB7,CNT=%lu,T=%lu\r\n",
                           (unsigned long)pb7_edges, (unsigned long)get_elapsed_ms(start));
                    return 1u;
                }
            }
            delay_ms(2);
        }
        printf("+TEST:HALL,FAIL,TIMEOUT,CNT=%lu\r\n", (unsigned long)pb7_edges);
        return 0u;
    }

    /* Instant read */
    uint32_t pb7 = (PB->PIN & BIT7) ? 1u : 0u;
    uint32_t pb8 = (PB->PIN & BIT8) ? 1u : 0u;
    printf("+TEST:HALL,PASS,PB7=%lu,PB8=%lu\r\n",
           (unsigned long)pb7, (unsigned long)pb8);
    return 1u;
}

