wright0418/Richlink_Smart_Box-M482S-/SampleCode/RL_SPORT/test_mode.c
/* ------------------------------------------------------------------ */
/* AT+TEST=BLE,NAME / AT+TEST=BLE,MAC                                 */
/* ------------------------------------------------------------------ */
static uint8_t AT_BleName(void)
{
    char device_name[SYS_DEVICE_NAME_BUF_SIZE];

    if (!Test_BLE_SwitchToCmdMode())
    {
        printf("+TEST:BLE,FAIL,CMD_MODE\r\n");
        return 0u;
    }

    /* Let BLE module settle after CMD mode switch and drain pending data */
    delay_ms(TEST_BLE_SETTLE_MS);
    CheckBleRecvMsg();

    Sys_ClearDeviceName();
    BLE_UART_SEND((void *)UART1, "%s", BLE_CMD_NAME_QUERY);

    uint32_t start = get_ticks_ms();
    while (!is_timeout(start, TEST_BLE_NAME_TIMEOUT_MS))
    {
        CheckBleRecvMsg();
        if (Test_BLE_CopyDeviceNameSnapshot(device_name, (uint32_t)sizeof(device_name)))
        {
            uint8_t ok = (strstr(device_name, "ROPR_") || strstr(device_name, "ROPE_")) ? 1u : 0u;
            printf("+TEST:BLE,%s,NAME=%s\r\n", ok ? "PASS" : "FAIL", device_name);
            Test_BLE_SwitchToDataMode();
            return ok;
        }
        delay_ms(5u);
    }

    printf("+TEST:BLE,FAIL,NO_RESPONSE\r\n");
    Test_BLE_SwitchToDataMode();
    return 0u;
}

static uint8_t AT_BleMac(void)
{
    char mac_addr[SYS_MAC_ADDR_BUF_SIZE];

    if (!Test_BLE_SwitchToCmdMode())
    {
        printf("+TEST:BLE,FAIL,CMD_MODE\r\n");
        return 0u;
    }

    /* Single attempt MAC query: keep timing simple (one CMD-mode query). */
    /* small gap to allow module to settle after mode switch */
    delay_ms(200u);
    Sys_ClearMacAddr();
    BLE_UART_SEND((void *)UART1, "%s", BLE_CMD_ADDR_QUERY);

    uint32_t start = get_ticks_ms();
    while (!is_timeout(start, TEST_BLE_MAC_TIMEOUT_MS))
    {
        CheckBleRecvMsg();
        if (Test_BLE_CopyMacAddrSnapshot(mac_addr, (uint32_t)sizeof(mac_addr)))
        {
            printf("+TEST:BLE,PASS,MAC=%s\r\n", mac_addr);
            Test_BLE_SwitchToDataMode();
            return 1u;
        }
        delay_ms(5u);
    }

    /* Keep standalone BLE,MAC aligned with AT+TEST=ALL semantics:
       some module / FW combinations do not provide a parseable MAC reply
       in command mode, so treat this as informational instead of a hard fail. */
    printf("+TEST:BLE,INFO,MAC=NA\r\n");
    Test_BLE_SwitchToDataMode();
    return 1u;
}

static uint8_t AT_Ble(const char *param)
{
    char tok[8];
    copy_token(param, tok, sizeof(tok));

    if (strcmp(tok, "NAME") == 0)
        return AT_BleName();
    if (strcmp(tok, "MAC") == 0)
        return AT_BleMac();

    printf("+TEST:BLE,FAIL,BAD_PARAM\r\n");
    return 0u;
}

/* ------------------------------------------------------------------ */
/* AT+TEST=USB                                                         */
/* ------------------------------------------------------------------ */
static uint8_t AT_Usb(const char *param)
{
    (void)param;
    UsbHidMouse_TestStart();

    uint32_t start = get_ticks_ms();
    uint32_t last_update = get_ticks_ms();
    while (!is_timeout(start, 5000))
    {
        if (get_elapsed_ms(last_update) >= 1u)
        {
            last_update = get_ticks_ms();
            UsbHidMouse_TestUpdate();
        }
    }

    UsbHidMouse_TestStop();
    printf("+TEST:USB,PASS,DUR=5000\r\n");
    return 1u;
}

/* ------------------------------------------------------------------ */
/* AT+TEST=PWR,VBUS / AT+TEST=PWR,LOCK                                */
/* ------------------------------------------------------------------ */
static uint8_t AT_Pwr(const char *param)
{
    char tok[8];
    copy_token(param, tok, sizeof(tok));

    if (strcmp(tok, "VBUS") == 0)
    {
        uint8_t vbus = USBDetect_IsHigh();
        printf("+TEST:PWR,PASS,VBUS=%u\r\n", (unsigned)vbus);
        return 1u;
    }
    if (strcmp(tok, "LOCK") == 0)
    {
#if POWER_LOCK_ENABLE
        uint32_t pa11 = (PA->PIN & BIT11) ? 1u : 0u;
        printf("+TEST:PWR,PASS,PA11=%lu\r\n", (unsigned long)pa11);
#else
        printf("+TEST:PWR,SKIP,PA11=DISABLED\r\n");
#endif
        return 1u;
    }
    printf("+TEST:PWR,FAIL,BAD_PARAM\r\n");
    return 0u;
}

/* ------------------------------------------------------------------ */
/* AT+TEST=ALL — run all auto-testable items                           */
/* ------------------------------------------------------------------ */

/* BLE combined NAME+MAC test for AT_All (single CMD-mode session) */
static void AT_All_Ble(uint32_t *pass, uint32_t *fail)
{
    uint8_t ble_ok = 0u;
    uint8_t got_name_resp = 0u;
    char device_name[SYS_DEVICE_NAME_BUF_SIZE];
    char mac_addr[SYS_MAC_ADDR_BUF_SIZE];

    if (Test_BLE_SwitchToCmdMode())
    {
        /* Let BLE module settle after CMD mode switch */
        delay_ms(TEST_BLE_SETTLE_MS);
        CheckBleRecvMsg();

        /* NAME */
        Sys_ClearDeviceName();
        BLE_UART_SEND((void *)UART1, "%s", BLE_CMD_NAME_QUERY);
        uint32_t start = get_ticks_ms();
        while (!is_timeout(start, TEST_BLE_NAME_TIMEOUT_MS))
        {
            CheckBleRecvMsg();
            if (Test_BLE_CopyDeviceNameSnapshot(device_name, (uint32_t)sizeof(device_name)))
            {
                got_name_resp = 1u;
                if (strstr(device_name, "ROPR_") || strstr(device_name, "ROPE_"))
                {
                    printf("+TEST:BLE,PASS,NAME=%s\r\n", device_name);
                    ble_ok = 1u;
                }
                else
                {
                    printf("+TEST:BLE,FAIL,NAME=%s\r\n", device_name);
                }
                break;
            }
            delay_ms(5u);
        }
        if (!ble_ok && !got_name_resp)
        {
            printf("+TEST:BLE,FAIL,NO_RESPONSE\r\n");
        }

        /* MAC (reuse CMD mode — gap after NAME response) */
        delay_ms(200u);
        Sys_ClearMacAddr();
        BLE_UART_SEND((void *)UART1, "%s", BLE_CMD_ADDR_QUERY);
        start = get_ticks_ms();
        uint8_t mac_ok = 0u;
        while (!is_timeout(start, 2000u))
        {
            CheckBleRecvMsg();
            if (Test_BLE_CopyMacAddrSnapshot(mac_addr, (uint32_t)sizeof(mac_addr)))
            {
                printf("+TEST:BLE,PASS,MAC=%s\r\n", mac_addr);
                mac_ok = 1u;
                break;
            }
            delay_ms(5u);
        }
        if (!mac_ok)
        {
            /* In ALL flow, MAC query is informative only; do not fail. */
            printf("+TEST:BLE,INFO,MAC=NA\r\n");
            mac_ok = 1u;
        }

        Test_BLE_SwitchToDataMode();

        if (ble_ok)
            (*pass)++;
        else
            (*fail)++;
        if (mac_ok)
            (*pass)++;
        else
            (*fail)++;
    }
    else
    {
        printf("+TEST:BLE,FAIL,CMD_MODE\r\n");
        printf("+TEST:BLE,FAIL,CMD_MODE\r\n");
        *fail += 2u;
    }
}

static void AT_All(void)
{
    uint32_t pass = 0u;
    uint32_t fail = 0u;

#define TRACK(fn)   \
    do              \
    {               \
        if (fn)     \
            pass++; \
        else        \
            fail++; \
    } while (0)

    /* 1. INFO — always pass */
    AT_Info(NULL);
    pass++;

    /* 2. LED BLINK */
    TRACK(AT_Led("BLINK"));

    /* 3. BUZZER */
    TRACK(AT_Buzzer(NULL));

